app/views/welcome/result.html.slim

            span.h4 =link_to 'click here', {}, class:"link_underline background_transparent", style: "color: grey"
    -if Contact.at_least_one_contact_verified?(@contacts) && Complaint.where(organization_id: @current_org.id).count ==0 && @escalation_rules.count != 0
---
SELECT "contacts".* FROM "contacts"  WHERE "contacts"."organization_id" = $1  [["organization_id", 19]]
SELECT COUNT(*) FROM "contacts"  WHERE "contacts"."organization_id" = $1  [["organization_id", 19]]

                  .table.zero-padding.added_contacts_edit id="added_contacts_#{er.id}"
                    - er.levels.map{|l| [l,l.contact]}.each do |x|
                      .col-md-5 id="contact_#{er.id}_#{x[1].id}"
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = $1 LIMIT 1  [["id", 17]]
SELECT "levels".* FROM "levels"  WHERE "levels"."contact_id" = $1  [["contact_id", 17]]