app/controllers/application_controller.rb

  def toggle_tour
    current_user.update_attribute(:tour_taken,!current_user.tour_taken)
---
UPDATE "users" SET "encrypted_password" = $1, "tour_taken" = $2, "updated_at" = $3 WHERE "users"."id" = 18  [["encrypted_password", "$2a$10$4ntZBipuIC8Uxfz/ALHGfubAlaEZ6UokX6SnTkpMVPhz6C6ddCZvC"], ["tour_taken", "f"], ["updated_at", "2015-05-26 05:51:37.693754"]]

  def home
    if current_user.nil?
      render :template => "home/landing"
    else
      if current_user.contacts.empty?
---
SELECT  1 AS one FROM "contacts"  WHERE "contacts"."user_id" = $1 LIMIT 1  [["user_id", 18]]