app/controllers/call_user_controller.rb

  def caller
    @escalation_rule = EscalationRule.find_by rule_key: params[:rule_key]
---
SELECT  "escalation_rules".* FROM "escalation_rules"  WHERE "escalation_rules"."rule_key" = '121212121' LIMIT 1