app/controllers/call_next_level_controller.rb

SELECT  "escalation_rules".* FROM "escalation_rules"  WHERE "escalation_rules"."rule_key" IS NULL LIMIT 1
---
  def next_call
    @escalation_rule = EscalationRule.find_by rule_key: params[:escalation_rule_key]