app/controllers/complaint_controller.rb

  def index
    if current_org.contacts.empty?
      redirect_to setup_1_path
    end
    offset = (params[:page] || 0 ) * 20
    @complaints = Complaint.where(escalation_rule: EscalationRule.where(organization: current_org)).preload(:call_log).order(id: :desc).limit(20).offset(offset)
---
SELECT  "complaints".* FROM "complaints"  WHERE "complaints"."escalation_rule_id" IN (SELECT "escalation_rules"."id" FROM "escalation_rules"  WHERE "escalation_rules"."organization_id" = 19)  ORDER BY "complaints"."id" DESC LIMIT 20 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "complaints"  WHERE "complaints"."escalation_rule_id" IN (SELECT "escalation_rules"."id" FROM "escalation_rules"  WHERE "escalation_rules"."organization_id" = 19) LIMIT 20 OFFSET 0) subquery_for_count