app/controllers/contacts_controller.rb

UPDATE "users" SET "confirmation_sent_at" = ?, "confirmation_token" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["confirmation_sent_at", "2015-05-29 07:46:28.534511"], ["confirmation_token", "78ccb87bcc8583ddc1ace57c74e5b6c30a1a896b7f6a976ee576a3f0fd2ad261"], ["updated_at", "2015-05-29 07:46:28.534797"]]
---
  def create
    @old_user = User.where(email: params["contact"]["email_id"]).first
    @user = @old_user.nil? ? User.create(email: params["contact"]["email_id"]) : @old_user
    OrganizationUser.where(user_id: @user.id, organization_id: current_org.id).first_or_create
    @contact = @user.contacts.new(contact_params)
    @contact.organization = current_org
    if contact_params["phone_number"]!=nil
      @contact.phone_number = "0"+contact_params["phone_number"].gsub(/\s+/,"").slice(-10,10)
      if !Contact.where(phone_number: @contact.phone_number).empty?
        @contact.confirmed_at = Contact.where(phone_number: @contact.phone_number).order(confirmed_at: :desc).last.confirmed_at
      end
    end
    respond_to do |format|
      if @contact.save