app/controllers/contacts_controller.rb

  def create
    @old_user = User.where(email: params["contact"]["email_id"]).first
    @user = @old_user.nil? ? User.create(email: params["contact"]["email_id"]) : @old_user
    OrganizationUser.where(user_id: @user.id, organization_id: current_org.id).first_or_create
    @contact = @user.contacts.new(contact_params)
    @contact.organization = current_org
    @contact.phone_number = "0"+contact_params["phone_number"].gsub(/\s+/,"").slice(-10,10)
    respond_to do |format|
      if @contact.save
        if current_org.escalation_rules.empty? and !@user.tour_taken
          @escalation_rule = current_org.escalation_rules.create(name: 'Sample Rule')
          Level.create(escalation_rule: @escalation_rule, contact_id: @contact.id, level_number: 1)
        end
        @user.send_confirmation_instructions if @old_user.nil?
        OnboardingMailer.send_invitation_email(
          @user, @contact.name, current_user.contacts.first.name,
          @contact.phone_number, current_org.name).deliver!
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'sa@email.com'  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "contacts" ("created_at", "email_id", "name", "phone_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-26 07:35:37.462341"], ["email_id", "poiuyrewdfghjkl;k"], ["name", "sanat"], ["phone_number", "-0987654"], ["updated_at", "2014-09-26 07:35:37.462341"], ["user_id", 1]]
INSERT INTO "users" ("created_at", "email", "encrypted_password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
INSERT INTO "organization_users" ("created_at", "organization_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-29 07:46:28.356768"], ["organization_id", 1], ["updated_at", "2015-05-29 07:46:28.356768"], ["user_id", 2]]
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."user_id" = ?  ORDER BY "contacts"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "organization_users".* FROM "organization_users"  WHERE "organization_users"."user_id" = 2 AND "organization_users"."organization_id" = 1  ORDER BY "organization_users"."id" ASC LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  1 AS one FROM "escalation_rules"  WHERE "escalation_rules"."organization_id" = ? LIMIT 1  [["organization_id", 1]]
SELECT  1 AS one FROM "users"  WHERE "users"."email" = 'sa@email.com' LIMIT 1
INSERT INTO "escalation_rules" ("created_at", "name", "organization_id", "rule_key", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "levels" ("contact_id", "created_at", "escalation_rule_id", "level_number", "updated_at") VALUES (?, ?, ?, ?, ?)  [["contact_id", 1], ["created_at", "2015-05-29 07:46:28.363528"], ["escalation_rule_id", 1], ["level_number", 1], ["updated_at", "2015-05-29 07:46:28.363528"]]
SELECT  "organizations".* FROM "organizations" INNER JOIN "organization_users" ON "organizations"."id" = "organization_users"."organization_id" WHERE "organization_users"."user_id" = ?  ORDER BY "organizations"."id" ASC LIMIT 1  [["user_id", 1]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "email_id" = ?, "name" = ?, "phone_number" = ?, "updated_at" = ? WHERE "contacts"."id" = 1  [["email_id", "random@example.com"], ["name", "akash"], ["phone_number", "1111111111"], ["updated_at", "2014-08-27 06:44:05.237705"]]

  def destroy
    @contact.destroy
---
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 19]]

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = $1 LIMIT 1  [["id", 19]]