app/controllers/escalation_rules_controller.rb

  def create
    @escalation_rule = current_org.escalation_rules.new(escalation_rule_params)
    params[:escalation_rule][:contacts].each do |i, contact|
      Level.create(escalation_rule: @escalation_rule, contact_id: contact['id'], level_number: contact['level'])
---
INSERT INTO "escalation_rules" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-26 07:35:48.740292"], ["name", "android"], ["updated_at", "2014-09-26 07:35:48.740292"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @escalation_rule.update(escalation_rule_params)
---
UPDATE "escalation_rules" SET "name" = ?, "updated_at" = ? WHERE "escalation_rules"."id" = 1  [["name", nil], ["updated_at", "2014-08-27 06:44:05.083381"]]

  def destroy
    @escalation_rule.destroy
---
DELETE FROM "escalation_rules" WHERE "escalation_rules"."id" = ?  [["id", 1]]

  def set_escalation_rule

    @escalation_rule = EscalationRule.find(params[:id])
---
SELECT  "escalation_rules".* FROM "escalation_rules"  WHERE "escalation_rules"."id" = ? LIMIT 1  [["id", 1]]