app/controllers/levels_controller.rb

INSERT INTO "levels" ("contact_id", "created_at", "escalation_rule_id", "level_number", "updated_at") VALUES (?, ?, ?, ?, ?)  [["contact_id", 1], ["created_at", "2014-09-26 07:36:03.750606"], ["escalation_rule_id", 1], ["level_number", 2], ["updated_at", "2014-09-26 07:36:03.750606"]]
---
  def create
    @level = Level.new(level_params)

    respond_to do |format|
      if @level.save

UPDATE "levels" SET "contact_id" = ?, "escalation_rule_id" = ?, "updated_at" = ? WHERE "levels"."id" = 1  [["contact_id", 5], ["escalation_rule_id", 7], ["updated_at", "2014-08-27 06:44:04.888196"]]
---
  def update
    respond_to do |format|
      if @level.update(level_params)

DELETE FROM "levels" WHERE "levels"."id" = ?  [["id", 1]]
---
  def destroy
    @level.destroy

SELECT  "levels".* FROM "levels"  WHERE "levels"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_level
      @level = Level.find(params[:id])