app/controllers/odin_client_controller.rb

INSERT INTO "call_logs" ("answered_at", "complaint_id", "created_at", "escalation_rule_key", "level_number", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def call_log
    call_log_params = params[:call_log]
    @odin_client = CallLog.create! phone_number: call_log_params[:phone_number],answered_at: call_log_params[:answered_at],escalation_rule_key: call_log_params[:escalation_rule_key], level_number: call_log_params[:level_number],complaint_id: call_log_params[:complaint_id]

SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."phone_number" = '111111'  ORDER BY "contacts"."id" ASC LIMIT 1
---
   def verify_contact
    contact = Contact.where(phone_number: params[:phone_number]).first