app/views/escalation_rules/show.html.slim

    th Contact Number
  - @escalation_rule.levels.order(level_number: :asc).each do |level|
---
SELECT "levels".* FROM "levels"  WHERE "levels"."escalation_rule_id" = ?  ORDER BY "levels"."level_number" ASC  [["escalation_rule_id", 1]]